Tutorials/spillingBreaker/kOmegaWilcox2006ReTB/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    outlet
    {
        type            totalPressure;
        p0              $internalField;
    }

    bottom
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    flatBed
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    slopeBed
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    atmosphere
    {
        type            totalPressure;
        p0              $internalField;
    }
}


// ************************************************************************* //
