Tutorials/spillingBreaker/kOmegaWilcox2006ReTB/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication decomposePar

foamJob -s -p snappyHexMesh -parallel -overwrite

runApplication reconstructParMesh -constant

runApplication extrudeMesh

runApplication changeDictionary

runApplication renumberMesh -overwrite

rm -r processor*

runApplication setWaveParameters

runApplication setWaveField

runApplication waveGaugesNProbes

# runApplication decomposePar

# runParallel $(getApplication)

#------------------------------------------------------------------------------
