Tutorials/spillingBreaker/kOmegaWilcox2006ReTB/constant/probeDefinitions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      loggingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceElevationAnyName
{
    type waveGauge;

    writeControl  timeStep;
    writeInterval 40;

    add       ( 0 0 0.7);
    axis      z;

    pointDistribution userDefinedDistribution;
    N 753;

    xValues nonuniform 753
    (
      -4.45000000000000
      -4.42500000000000
      -4.40000000000000
      -4.37500000000000
      -4.35000000000000
      -4.32500000000000
      -4.30000000000000
      -4.27500000000000
      -4.25000000000000
      -4.22500000000000
      -4.20000000000000
      -4.17500000000000
      -4.15000000000000
      -4.12500000000000
      -4.10000000000000
      -4.07500000000000
      -4.05000000000000
      -4.02500000000000
      -4
      -3.97500000000000
      -3.95000000000000
      -3.92500000000000
      -3.90000000000000
      -3.87500000000000
      -3.85000000000000
      -3.82500000000000
      -3.80000000000000
      -3.77500000000000
      -3.75000000000000
      -3.72500000000000
      -3.70000000000000
      -3.67500000000000
      -3.65000000000000
      -3.62500000000000
      -3.60000000000000
      -3.57500000000000
      -3.55000000000000
      -3.52500000000000
      -3.50000000000000
      -3.47500000000000
      -3.45000000000000
      -3.42500000000000
      -3.40000000000000
      -3.37500000000000
      -3.35000000000000
      -3.32500000000000
      -3.30000000000000
      -3.27500000000000
      -3.25000000000000
      -3.22500000000000
      -3.20000000000000
      -3.17500000000000
      -3.15000000000000
      -3.12500000000000
      -3.10000000000000
      -3.07500000000000
      -3.05000000000000
      -3.02500000000000
      -3
      -2.97500000000000
      -2.95000000000000
      -2.92500000000000
      -2.90000000000000
      -2.87500000000000
      -2.85000000000000
      -2.82500000000000
      -2.80000000000000
      -2.77500000000000
      -2.75000000000000
      -2.72500000000000
      -2.70000000000000
      -2.67500000000000
      -2.65000000000000
      -2.62500000000000
      -2.60000000000000
      -2.57500000000000
      -2.55000000000000
      -2.52500000000000
      -2.50000000000000
      -2.47500000000000
      -2.45000000000000
      -2.42500000000000
      -2.40000000000000
      -2.37500000000000
      -2.35000000000000
      -2.32500000000000
      -2.30000000000000
      -2.27500000000000
      -2.25000000000000
      -2.22500000000000
      -2.20000000000000
      -2.17500000000000
      -2.15000000000000
      -2.12500000000000
      -2.10000000000000
      -2.07500000000000
      -2.05000000000000
      -2.02500000000000
      -2
...
    );

    zValues nonuniform 753
    (
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
      -0.399900000000000
...
    );

    yValues uniform 0.05;

}


// ************************************************************************* //
