Tutorials/spillingBreaker/kOmegaWilcox2006ReTB/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    RASModel        kOmegaWilcox2006ReTB;

    turbulence      on;

    printCoeffs     on;

    kOmegaWilcox2006ReTBCoeffs
    {
        transitionalBuoyancy  true;
        Clim1         0.20;
        Clim2         0.05;
    }
}



// ************************************************************************* //
