Tutorials/spillingBreaker/kOmegaWilcox2006ReTB/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel            0;

relaxationNames     ( inlet );

initializationName  init;

inletCoeffs
{
    waveType            streamFunction;
    N                   32;
    Tsoft               2;
    depth               0.4;
    phi                 0;
    height              0.125;

    specifyPeriod       true;
    period              1.9999999173941;

    specifyEuler        false;
    stokesVelocity      0;

    omega               3.1415927833468;
    waveNumber          (1.6589775 0 0);
    uBar                1.9174361475421;
    A                   nonuniform List<scalar>
    32
    (
        0.05699203274306
        0.017723266289024
        0.0049828584173083
        0.0014661862502656
        0.00046255720767762
        0.00015478088159725
        5.4091028962117e-05
        1.9511657029707e-05
...
    );
    B                   nonuniform List<scalar>
    32
    (
        0.29431883370445
        0.09063569797988
        0.018985975828142
        0.0024669935808291
        2.5003106294075e-05
        -7.619266866324e-05
        -1.8136501732829e-05
        -9.4578689581138e-07
...
    );

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           INLET;
        startX              ( -4.7 -1 0 );
        endX                ( -0.7 1 0 );
        orientation         ( 1 0 0 );
    }
}

initCoeffs
{
    waveType            potentialCurrent;
    U                   ( 0 0 0 );
    Tsoft               2;
}



// ************************************************************************* //
