Tutorials/spillingBreaker/kOmegaWilcox2006ReTB/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
  	front
  	{
    		type            empty;
  	}

  	back
  	{
    		type            empty;
  	}
}

cellLevel
{
  	front
  	{
    		type            empty;
  	}

  	back
  	{
    		type            empty;
  	}
}

// ************************************************************************* //
