Tutorials/spillingBreaker/kOmegaWilcox2006ReTB/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
  "libCFIncompressibleRASModelsV1.so"
);

application     waveFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         101.0;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   12;

runTimeModifiable no;

adjustTimeStep  yes;

maxCo           0.05;

maxAlphaCo      0.05;

maxDeltaT       0.01;

functions
{
    #includeIfPresent "../waveGaugesNProbes/surfaceElevationAnyName_controlDict";
}

// ************************************************************************* //
