Tutorials/spillingBreaker/kOmegaWilcox2006ReTB/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom   patch;
sourceCase      ".";
sourcePatches   (back);
exposedPatchName front;

flipNormals     true;

extrudeModel    linearNormal;

nLayers             1;
expansionRatio      1.0;

linearNormalCoeffs
{
    thickness       0.1;
}

mergeFaces      false;

// ************************************************************************* //
